[
  {
    "title": "Action Comics #1022",
    "releaseDate": "June 2, 2020",
    "description": "First, Metropolis was hit with the biggest ground battle in the history of the city and barely survived. On top of that, Leviathan threw down his gauntlet for the entire world to see, and Superman revealed the truth of his identity as Clark Kent. Now the city is in a state of shock-and Clark and Conner Kent need to figure out what’s next for them and the city they protect! Guest-starring Wonder Comics’ Young Justice in a unique crossover!",
    "price": "$3.99",
    "series": "Action Comics 2016",
    "imageUrl": "https://www.dccomics.com/sites/default/files/styles/covers192x291/public/comic-covers/2020/05/AC_1022_300-001_HD_5ed009da485de6.93463568.jpg",
    "url": "http://www.dccomics.com/comics/action-comics-2016/action-comics-1022"
  },
  {
    "title": "Batman/Superman #9",
    "releaseDate": "June 2, 2020",
    "description": "“Atomic” part one! The Atomic Skull is dead. When Batman and Superman arrive on the scene of his explosive demise, they discover that this villain-turned-would-be hero was one of many people to be the subject of grisly-and sometimes fatal-experiments. But who is pulling the strings of these bizarre and unnecessary surgeries? Whom will they experiment on next? And what does one of Superman’s oldest foes, the Ultra-Humanite, have to do with this deadly mystery?",
    "price": "$3.99",
    "series": "Batman/Superman 2019",
    "imageUrl": "https://www.dccomics.com/sites/default/files/styles/covers192x291/public/comic-covers/2020/05/BMSM_09_300-001_HD_5ed009e1702938.08877549.jpg",
    "url": "http://www.dccomics.com/comics/batmansuperman-2019/batmansuperman-9"
  },
  {
    "title": "Batman: Gotham Nights #7",
    "releaseDate": "June 2, 2020",
    "description": "When Batman’s old nemesis Killer Moth is shot dead in an everyday burglary, the World’s Greatest Detective knows there must be more to the story. After all, this is one of Batman’s earliest foes, and if there’s anything Batman learned from those early fights, it’s that you always need a backup plan!",
    "price": "$0.99",
    "series": "Batman Gotham Nights 2020",
    "imageUrl": "https://www.dccomics.com/sites/default/files/styles/covers192x291/public/comic-covers/2020/05/BM_DCDF_07-%28Cover%29_5ed16f6c13afc4.84961552.jpg",
    "url": "http://www.dccomics.com/comics/batman-gotham-nights-2020/batman-gotham-nights-7"
  }
]